#define _CRT_SECURE_NO_WARNINGS
//练习案例：敲桌子
//案例描述：从1开始数到数字100， 
//如果数字个位含有7，
//或者数字十位含有7，
//或者该数字是7的倍数，
//我们打印敲桌子，
//其余数字直接打印输出。

//1.先输出1~100 这些数字

//2.从这100个数字中找到特殊数字,改为"敲桌子"
  //          7的倍数 (7,14,21,28...) %7=0
  //特殊数字  个位有7 (7,17,27,37...) %10=7
  //          十位有7 (70,71,72,73...) /10=7

#include<iostream>
using namespace std;
int main()
{
	//1.输出1~100
	int i = 1;
	for (i = 1; i <= 100; i++)
	{
		//2.从1~100中找特殊数字,打印"敲桌子"
		if ((i%7==0)||(i%10==7)||(i/10==7))
		{
			cout <<"敲桌子"<< endl;
		}
		else
		{
			cout << i << endl;
		}		
	}
	system("pause");
	return 0;
}